Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: and \b word boundary /e evaluate /ee rpts
es: and \b límite de palabra /e evaluar /ee reevaluar

source: and C<no myint;> is
es: y C<no entero;> se convierte en:

source: and calling C<Perl_mro_register>:
es: y llamar a C<Perl_mro_register>:

source: and if you are not happy with either the description or the patch itself you can fix it up by editing the files once more and then issue:
es: y si no queda satisfecho con la descripción o con el parche, puede editar los archivos para corregirlos y ejecutar a continuación:

source: and is I<not> the same as writing:
es: y I<no> es lo mismo que escribir:

source: and their source code:
es: y su código fuente:

source: apple => "red",
es: manzana => "rojo",

source: arbitrarily nested data structures and anonymous functions
es: estructuras de datos anidadas de profundidad arbitraria y funciones anónimas

source: array => { description => "ordered list of items", sigil => '@', },
es: array => { descripcion => "lista ordenada de elementos", sigilo => '@', },

source: arrayref ${$$foo[1]}[2] aka $foo->[1]->[2]
es: anón. ${$$foo[1]}[2] equivale a $foo->[1]->[2]

source: as UTF-8-encoded Unicode.
es: como caracteres Unicode codificados en UTF-8.

source: as after matching the A but failing on the B the C<(*THEN)> verb will backtrack and try C; but the C<(*PRUNE)> verb will simply fail.
es: ya que, si se detecta A pero no se detecta B, el verbo C<(*THEN)> volverá atrás y probará con C; en cambio, el verbo C<(*PRUNE)> simplemente generará un error de coincidencia.

source: as we know that if the final quote does not match, backtracking will not help.
es: ya que sabemos que si no se detecta la comilla doble final, no servirá de nada dar marcha atrás.

source: assigns the entire list value to array @foo, but
es: asigna la lista completa al array @foo, pero

source: assigns the value of variable $bar to the scalar variable $foo.
es: asigna el valor de la variable $bar a la variable escalar $foo.

source: autosplit("$dir:Some:Module.pm", "$dir:auto", 0, 1, 1);
es: autosplit("$dir:Mi:Modulo.pm", "$dir:auto", 0, 1, 1);

source: banana => "yellow",
es: plátano => "amarillo",

source: because the main point isn't whether the user typed B<-v> or not.
es: porque el objetivo principal no es saber si el usuario ejecutó el programa con el modificador B<-v> (de I<verbose>, que se podría traducir como "locuaz" y en este contexto quiere decir "detallado").

source: because the second way hides the main point of the statement in a modifier.
es: porque la segunda forma esconde el objetivo principal de la instrucción dentro de un modificador.

source: bless $foo, 'Class';
es: bless $foo, 'Clase';

source: bless $self, $class;
es: bless $self, $clase;

source: bless \$value, $class;
es: bless \$valor, $clase;

source: but
es: pero

source: but doesn't spit out extra fields.
es: pero no devuelve campos adicionales.

source: by Damian Conway
es: Damian Conway

source: by Darren Chamberlain, Dave Cross, and Andy Wardley
es: Darren Chamberlain, Dave Cross y Andy Wardley

source: by Dave Cross
es: Dave Cross

source: by David N. Blank-Edelman
es: David N. Blank-Edelman

source: by James Lee
es: James Lee

source: by Jan Goyvaerts and Steven Levithan
es: Jan Goyvaerts y Steven Levithan

source: by Jeffrey E. F. Friedl
es: Jeffrey E. F. Friedl

source: by Johan Vromans
es: Johan Vromans

source: by Jon Bentley
es: Jon Bentley

source: by Joseph N. Hall, Joshua A. McAdams, brian d foy
es: Joseph N. Hall, Joshua A. McAdams, brian d foy

source: by Larry Wall, Tom Christiansen, and Jon Orwant
es: Larry Wall, Tom Christiansen y Jon Orwant

source: by Linchi Shea
es: Linchi Shea

source: by Lincoln Stein
es: Lincoln Stein

source: by Mark-Jason Dominus
es: Mark-Jason Dominus

source: by Randal L. Schwartz and brian d foy, with Tom Phoenix
es: Randal L. Schwartz y brian d foy, con Tom Phoenix

source: by Randal L. Schwartz, Tom Phoenix, and brian d foy
es: Randal L. Schwartz, Tom Phoenix y brian d foy

source: by Richard Foley
es: Richard Foley

source: by Richard Foley with Andy Lester
es: Richard Foley con Andy Lester

source: by Sam Tregar
es: Sam Tregar

source: by Steve Lidie and Nancy Walsh
es: Steve Lidie y Nancy Walsh

source: by Tim Bunce and Alligator Descartes
es: Tim Bunce y Alligator Descartes

source: by Tim Jenness and Simon Cozens
es: Tim Jenness y Simon Cozens

source: by Tom Christiansen and Nathan Torkington
es: Tom Christiansen y Nathan Torkington

source: by Tom Christiansen and Nathan Torkington,
es: Tom Christiansen y Nathan Torkington,

source: by Tony Stubblebine
es: Tony Stubblebine

source: by brian d foy
es: brian d foy

source: can be rewritten as the much more efficient
es: se puede reescribir de forma mucho más eficiente como

source: causes variables, subroutines, formats, and file and directory handles accessible via the identifier C<richard> also to be accessible via the identifier C<dick>.
es: hace que las variables, subrutinas, formatos e identificadores de archivos y directorios a los que se accede mediante el identificador C<beatriz> también sean accesibles mediante C<bea>.

source: chdir($tmpdir) or die "can't chdir $tmpdir: $!";
es: chdir($tmpdir) or die "no se puede ejecutar chdir $tmpdir: $!";

source: close $fh or die $!;
es: close $archivo or die $!;

source: close $in or die "$in: $!";
es: close $entrada or die "$entrada: $!";

source: contains all the elements of @foo followed by all the elements of @bar, followed by all the elements returned by the subroutine named SomeSub called in list context, followed by the key/value pairs of %glarch.
es: contiene todos los elementos de @foo, seguidos de todos los elementos de @bar, seguidos de todos los elementos devueltos por la subrutina AlgunaSub llamada en contexto de lista, seguidos de los pares clave/valor de %glarch.

# content => "foo ",
source: content => "foo\n",
es: contenido => "foo\n",

source: content => $mp3_data,
es: contenido => $datos_mp3,

source: cpan.org?
es: ¿Y cpan.org?

source: decimal string --> native floating point (*)
es: cadena decimal --> punto flotante nativo (*)

source: decimal string --> native integer
es: cadena decimal --> entero nativo

source: die "Can't open $foo: $!" unless open(FOO,$foo);
es: die "No se puede abrir $foo: $!" unless open(FOO,$foo);

source: die "No argument to customre::import allowed" if @_;
es: die "No se permiten argumentos para rxpersonal::import" if @_;

source: die "No such attribute: $called" unless exists $self->{$called};
es: die "No existe el atributo $llamado" unless exists $self->{$llamado};

source: die "You cannot create a File::MP3 without an mp3 extension\n" unless $path =~ /\.mp3\z/;
es: die "No puede crear un objeto Archivo::MP3 sin la extensión mp3\n" unless $ruta =~ /\.mp3\z/;

source: differ from each other in two ways.
es: difieren en dos aspectos.

source: djtarx ( ftp://ftp.delorie.com/pub/djgpp/current/v2/ ) will both uncompress and unpack.
es: djtarx ( ftp://ftp.delorie.com/pub/djgpp/current/v2/ ) descomprimirá y desempaquetará.

source: embeddable and extensible
es: capacidad de integración y ampliación

source: encode your string, and then follow this with a C<U*> somewhere in your
es: de la cadena, y luego continuar con C<U*> en algún lugar del

source: enhanced debugger and interactive Perl environment, with integrated editor support
es: depurador mejorado y entorno Perl interactivo, compatible con un editor integrado

source: eq equality
es: eq igual que

source: ext ext/**/*.{[hcyt],xs,pm} (for -5.10.1) or
es: ext ext/**/*.{[hcyt],xs,pm} (para -5.10.1) o

source: fieldhash my %time_for;
es: fieldhash my %hora_para;

source: for $pat (@pats) {
es: for $patron (@patrones) {

source: force the argument into the integer format.
es: Fuerzan la conversión del argumento al formato de entero.

source: force the argument into the string format.
es: Fuerzan la conversión del argumento al formato de cadena.

source: forces arguments to integer format.
es: Fuerzan la conversión de los argumentos al formato de entero.

source: foreach (@hash{qw[key1 key2]}) {
es: foreach (@hash{qw[clave1 clave2]}) {

source: foreach my $key (keys %hash) {
es: foreach my $clave (keys %hash) {

source: foreword by Damian Conway
es: prólogo de Damian Conway

source: freopen(fn, mode, stream) PerlIO_reopen(fn, mode, perlio) (Deprecated)
es: freopen(fn, mode, stream) PerlIO_reopen(fn, mode, perlio) (obsoleta)

source: from_to($string, 'FOO', 'BAR'); # changes contents of $string
es: from_to($cadena, 'A', 'B'); # cambia el contenido de $cadena

source: ge greater than or equal
es: ge mayor o igual que

source: give $gollum "Fisssssh!";
es: give $gollum "¡Pesssscar!";

source: give $gollum "Precious!";
es: give $gollum "¡Mi tesssoro!";

source: got <d is under the >
es: se obtiene <, al mediodía, se >

source: got <d is under the bar in the >
es: se obtiene <, al mediodía, se come, y en el >

source: green chile
es: chile verde

source: gt greater than
es: gt mayor que

source: gzip -d Your-Module.tgz
es: gzip -d Mi-Modulo.tgz

source: gzip -dc yourmodule.tar.gz | tar -xof -
es: gzip -dc mi_modulo.tar.gz | tar -xof -

source: has content => ( is => 'ro' );
es: has contenido => ( is => 'ro' );

source: has is_on => (
es: has encendido => (

source: has last_mod_time => ( is => 'ro' );
es: has hora_ult_mod => ( is => 'ro' );

source: has path => ( is => 'ro' );
es: has ruta => ( is => 'ro' );

source: hash => { description => "key/value pairs", sigil => '%', },
es: hash => { descripcion => "pares clave-valor", sigilo => '%', },

source: hashref ${$$foo[1]}[2] aka $foo->[1][2]
es: anón. ${$$foo[1]}[2] equivale a $foo->[1][2]

source: hello
es: hola

source: http://www.cpan.org/ the Comprehensive Perl Archive
es: http://www.cpan.org/ I<Comprehensive Perl Archive Network>

source: http://www.perl.com/ Perl articles (O'Reilly)
es: http://www.perl.com/ artículos sobre Perl (O'Reilly)

source: http://www.perl.org/ the Perl homepage
es: http://www.perl.org/ página de inicio del lenguaje Perl

source: http://www.pm.org/ the Perl Mongers
es: http://www.pm.org/ el sitio de Perl Mongers

source: identify_typeglob *bar::baz;
es: identificar_typeglob *bar::baz;

source: identify_typeglob *foo;
es: identificar_typeglob *foo;

# if ( /$pat/ ) { print " ";
source: if ( /$pat/ ) { print " \n";
es: if ( /$patron/ ) { print " \n";

source: if ( /$pattern/ ) { }
es: if ( /$patron/ ) { }

source: if ( /$pattern/i ) { }
es: if ( /$patron/i ) { }

source: if ( /(.*)(\d*)/ ) { # Wrong!
es: if ( /(.*)(\d*)/ ) { # ¡Incorrecto!

source: if ( /\b(foo)\s+(\w+)/i ) {
es: if ( /\b(come)\s+(\w+)/i ) {

source: if ( /^\D*(?!123)/ ) { # Wrong!
es: if ( /^\D*(?!123)/ ) { # ¡Incorrecto!

source: if ( /foo(.*)bar/ ) {
es: if ( /mesa(.*)come/ ) {

# if ( /foo(.*?)bar/ ) { print "got " }
source: if ( /foo(.*?)bar/ ) { print "got \n" }
es: if ( /mesa(.*?)come/ ) { print "obtiene \n" }

source: if ( condition ) {
es: if ( condición ) {

source: if ( defined blessed($thing) ) { ... }
es: if ( defined blessed($algo) ) { ... }

source: if ( my $meth = $object->can('foo') ) {
es: if ( my $metodo = $objeto->can('foo') ) {

source: if ($a =~ /foo/) { ... } # true if $a contains "foo"
es: if ($a =~ /foo/) { ... } # verdadero si $a contiene "foo"

source: if ($some_condition) {
es: if ($una_condicion) {

source: if ($string =~ /^\d+$/) { ... }
es: if ($cadena =~ /^\d+$/) { ... }

source: if ((caller(0))[3] eq 'subname') { ... }
es: if ((caller(0))[3] eq 'subnombre') { ... }

source: if (/Time: (..):(..):(..)/) { # parse out values
es: if (/Tiempo: (..):(..):(..)/) { # extrae valores

source: if (/foo $parens \s+ + \s+ bar $parens/x) {
es: if (/foo $parentesis \s+ \+ \s+ bar $parentesis/x) {

source: if (/foo/) { ... } # true if $_ contains "foo"
es: if (/foo/) { ... } # verdadero si $_ contiene "foo"

source: if (@_) { $self->{path} = shift;
es: if (@_) { $self->{ruta} = shift;

source: if (@animals < 5) { ... }
es: if (@animales < 5) { ... }

source: if (myint::in_effect(1)) { int($$l) + int($$r);
es: if (entero::in_effect(1)) { int($$l) + int($$r);

source: in Some_package: $name is 'fred'
es: en Un_paquete: $nombre es 'Pedro'

source: in main: $name is 'barney'
es: en main: $nombre es 'Pablo'

source: introduce everything else.
es: de incluir todo lo demás.

source: is a number.
es: es un número.

source: is a pointer.
es: es un puntero.

source: is a string.
es: es una cadena.

source: is a type.
es: es un tipo.

source: is better than
es: es preferible a

source: is equivalent to
es: es equivalente a

source: is equivalent to the more verbose
es: es equivalente a la siguiente expresión más larga

source: is exactly equivalent to
es: equivale exactamente a

source: is like
es: es como

source: is made equivalent to
es: es equivalente a

source: is not the same as
es: no es lo mismo que

source: is the same as
es: es lo mismo que

source: is( "1.20.300.4000", sprintf "%vd", pack(" U*",1,20,300,4000), " with spaces at the beginning" );
es: is( "1.20.300.4000", sprintf "%vd", pack(" U*",1,20,300,4000), " con espacios al comienzo" );

source: is( "1.20.300.4000", sprintf "%vd", pack("U*",1,20,300,4000), "U* produces Unicode" );
es: is( "1.20.300.4000", sprintf "%vd", pack("U*",1,20,300,4000), "U* produce Unicode" );

source: isnt( v1.20.300.4000, sprintf "%vd", pack("C0U*",1,20,300,4000), "U* not first isn't Unicode" );
es: isnt( v1.20.300.4000, sprintf "%vd", pack("C0U*",1,20,300,4000), "U* no aparece al principio, luego no es Unicode" );

source: keys(%users) = 1000; # allocate 1024 buckets
es: keys(%usuarios) = 1000; # asigna 1024 casillas

source: king (by no means comprehensive, see Changes* for details)
es: (no pretende ser una lista completa; puede ver los detalles en Changes*)

source: last LINE if $foo;
es: last LINEA if $foo;

source: last_mod_time => 1304974868,
es: hora_ult_mod => 1304974868,

source: le less than or equal
es: le menor o igual que

source: lexical scoping
es: ámbito léxico

source: line 123.
es: línea 123.

source: line number
es: número de línea

source: list %hash HASH $array[0] $hash{'a'} &sub CODE *glob GLOB SCALAR VALUES FORMAT number, string, ref, glob, undef
es: lista %hash HASH $array[0] $hash{'a'} &sub CODE *glob GLOB VALORES ESCALARES FORMAT número, cadena, ref, glob, undef

source: list ops | alternation /l locale /d dual
es: ops lista | alternancia /l config. reg. /d dual

source: local *FH; # not my!
es: local *ARCHIVO; # en lugar de "my"

source: local $bar = 2; # Restrict changes to block
es: local $bar = 2; # Restringe los cambios al bloque

source: local *Here::blue = \$There::green;
es: local *este::azul = \$ese::verde;

source: local *hashsym = shift;
es: local *sim_hash = shift;

source: logger("We have a logger subroutine!");
es: registrador("Tenemos una subrutina para registrar.");

source: looks like a quantifier that matches 0 times, since 4 is greater than 3, but it really means to match the sequence of six characters S<C<"o { 4 , 3 }">>.)
es: parece un cuantificador que coincide 0 veces (ya que 4 es mayor que 3), pero en realidad esta expresión detecta la secuencia de seis caracteres S<C<"o { 4 , 3 }">>).

source: lt less than
es: lt menor que

source: makes $this an alias for $that, @this an alias for @that, %this an alias for %that, &this an alias for &that, etc. Much safer is to use a reference.
es: hace que $este sea un alias de $ese, @este sea un alias de @ese, %este sea un alias de %ese, etc. Es mucho más seguro usar una referencia.

source: matches a chunk of non-parentheses, possibly included in parentheses themselves.
es: detecta un fragmento de caracteres que no son paréntesis, posiblemente entre paréntesis.

source: means regular files.
es: significa archivos normales.

source: means to use Unicode rules when pattern matching.
es: significa que se usan las reglas de Unicode al detectar coincidencias de patrones.

source: means to use the current locale's rules (see L<perllocale>) when pattern matching.
es: significa que se usan las reglas de la configuración regional en vigor (vea L<perllocale>) al detectar coincidencias de patrones.

source: mkdir $tmpdir, 0700 or die "can't mkdir $tmpdir: $!";
es: mkdir $tmpdir, 0700 or die "No se puede ejecutar mkdir $tmpdir: $!";

source: mkdir 'tmp', 0777 or die "can't mkdir $tmpdir/tmp: $!";
es: mkdir 'tmp', 0777 or die "No se puede ejecutar mkdir $tmpdir/tmp: $!";

source: modularity and reusability using innumerable modules
es: modularidad y capacidad de reutilización gracias a numerosos módulos

source: my $animal = "camel";
es: my $animal = "camello";

source: my $answer = 42;
es: my $respuesta = 42;

source: my $bar_string = encode('BAR', $text_string);
es: my $cadena_B = encode('B', $cadena_texto);

source: my $byte_count = length $binary;
es: my $numero_bytes = length $binario;

source: my $byte_count = length $body;
es: my $numero_bytes = length $cuerpo_texto;

source: my $cage = File::MP3->new(
es: my $minero = Archivo::MP3->new(

source: my $called = $AUTOLOAD =~ s/.*:://r;
es: my $llamado = $AUTOLOAD =~ s/.*:://r;

source: my $character_count = length $text;
es: my $numero_caracteres = length $texto;

source: my $class = 'Class';
es: my $clase = 'Clase';

source: my $class = 'File';
es: my $clase = 'Archivo';

source: my $class = shift;
es: my $clase = shift;

source: my $db = tie %hash, 'DB_File', $filename, O_CREAT|O_RDWR, 0666, $DB_HASH
es: my $db = tie %hash, 'DB_File', $archivo, O_CREAT|O_RDWR, 0666, $DB_HASH

source: my $db = tie(%hash, 'SDBM_File', $filename, O_RDWR|O_CREAT, 0640)
es: my $db = tie(%hash, 'SDBM_File', $archivo, O_RDWR|O_CREAT, 0640)

source: my $f = myopen("</etc/motd");
es: my $f = miopen("</etc/motd");

source: my $file = $class->new( $path, $data );
es: my $archivo = $clase->new( $ruta, $datos );

source: my $file = File->new( $path, $data );
es: my $archivo = Archivo->new( $ruta, $datos );

source: my $file = File->new(...);
es: my $archivo = Archivo->new(...);

source: my $file = new File $path, $data;
es: my $archivo = new Archivo $ruta, $datos;

source: my $file = new File:: $path, $data;
es: my $archivo = new Archivo::$ruta, $datos;

source: my $filename = "filt";
es: my $archivo = "filt";

source: my $foo = decode('UTF-8', get 'http://example.com/');
es: my $foo = decode('UTF-8', get 'http://ejemplo.com/');

source: my $hinthash = (caller($level))[10];
es: my $hash_pistas = (caller($nivel))[10];

source: my $hostname = File->new(
es: my $nombre_host = Archivo->new(

source: my $l = MyMaths->new(1.2);
es: my $l = MisOperadores->new(1.2);

source: my $level = shift // 0;
es: my $nivel = shift // 0;

source: my $line = <$in>;
es: my $linea = <$entrada>;

source: my $logmessage = $_[0]; # uncommon, and ugly
es: my $mensaje_registro = $_[0]; # poco común (y poco estético)

source: my $logmessage = shift;
es: my $mensaje_registro = shift;

source: my $method = 'save';
es: my $metodo = 'guardar';

source: my $mp3 = File::MP3->new( 'Andvari.mp3', $data );
es: my $mp3 = Archivo::MP3->new( 'Andvari.mp3', $datos );

source: my $object = bless {}, $class;
es: my $objeto = bless {}, $clase;

source: my $object = bless {};
es: my $objeto = bless {};

source: my $parens = qr/(\((?:[^()]++|(?-1))*+\))/;
es: my $parentesis = qr/(\((?:[^()]++|(?-1))*+\))/;

source: my $path = shift;
es: my $ruta = shift;

source: my $pod = File->new( 'perlobj.pod', $data );
es: my $pod = Archivo->new( 'perlobj.pod', $datos );

source: my $prefix = shift // "This file is at ";
es: my $prefijo = shift // "Ruta del archivo: ";

source: my $priv_func = sub {
es: my $func_priv = sub {

source: my $priv_var = '';
es: my $var_priv = '';

source: my $r = MyMaths->new(3.4);
es: my $r = MisOperadores->new(3.4);

source: my $result = $num * $num;
es: my $resultado = $num * $num;

source: my $self = bless \( my $object ), $class;
es: my $self = bless \( my $objeto ), $clase;

source: my $self = bless { path => $path, data => $data,
es: my $self = bless { ruta => $ruta, datos => $datos,

source: my $some_condition = 1;
es: my $una_condicion = 1;

source: my $string = 'ABC';
es: my $cadena = 'ABC';

source: my $text_string = decode('FOO', $foo_string);
es: my $cadena_texto = decode('A', $cadena_A);

source: my $time = Time->new();
es: my $hora = Hora->new();

source: my $time = Time->new;
es: my $hora = Hora->new();

source: my $time = time;
es: my $hora = time;

source: my $var = "value";
es: my $var = "valor";

source: my %fruit_color = (
es: my %color_fruta = (

source: my %fruit_color = ("apple", "red", "banana", "yellow");
es: my %color_fruta = ("manzana", "rojo", "plátano", "amarillo");

source: my %nhash = (); # do what you want
es: my %nhash = (); # haga lo que desee

source: my %rules = ( '\\' => '\\\\', 'Y|' => qr/(?=\S)(?<!\S)|(?!\S)(?<=\S)/ );
es: my %reglas = ( '\\' => '\\\\', 'Y|' => qr/(?=\S)(?<!\S)|(?!\S)(?<=\S)/ );

source: my %secret_hash = ();
es: my %hash_secreto = ();

source: my ( $path, $data ) = @_;
es: my ( $ruta, $datos ) = @_;

source: my ($class, $value) = @_;
es: my ($clase, $valor) = @_;

source: my ($logmessage, $priority) = @_; # common
es: my ($mensaje_registro, $prioridad) = @_; # común

source: my (@length_content) = unpack "(V/a)*", $binary;
es: my (@contenido_longitud) = unpack "(V/a)*", $binario;

source: my @animals = ("camel", "llama", "owl");
es: my @animales = ("camello", "llama", "búho");

source: my @backwards = reverse @numbers;
es: my @orden_inverso = reverse @numeros;

source: my @captures = "a" =~ /(.)
es: my @capturas = "a" =~ /(.)

source: my @colors = values %fruit_colors;
es: my @colores = values %color_fruta;

source: my @fruits = keys %fruit_colors;
es: my @frutas = keys %color_fruta;

source: my @lines = <$in>;
es: my @lineas = <$entrada>;

source: my @mixed = ("camel", 42, 1.23);
es: my @mezcla = ("camello", 42, 1.23);

source: my @numbers = (23, 42, 69);
es: my @numeros = (23, 42, 69);

source: my @sorted = sort @animals;
es: my @ordenados = sort @animales;

source: my($a, $b, %rest) = @_;
es: my($a, $b, %resto) = @_;

source: myint->import();
es: entero->import();

source: myint->unimport();
es: entero->unimport();

source: m{ (?: NON_ZERO_LENGTH )* (?: ZERO_LENGTH )?
es: m{ (?: LONGITUD_DISTINTA_CERO )* (?: LONGITUD_CERO )?

source: m{ (?: NON_ZERO_LENGTH | ZERO_LENGTH )* }x;
es: m{ (?: LONGITUD_DISTINTA_CERO | LONGITUD_CERO )* }x;

source: m{ \( ( (?> [^()]+ ) # change x+ above to (?> x+ ) | \( [^()]* \) )+
es: m{ \( ( (?> [^()]+ ) # cambiar x+ anterior a (?> x+ ) | \( [^()]* \) )+

source: n and m are limited to non-negative integral values less than a preset limit defined when perl is built.
es: n y m están limitados a enteros no negativos menores que un límite predefinido establecido al compilar perl.

source: named uops if (e) { } elsif (e) { } else { }
es: ops unarios con nombre if (e) { } elsif (e) { } else { }

source: native floating_point --> decimal string (*)
es: punto flotante nativo --> cadena decimal (*)

source: native floating_point --> native integer (*)
es: punto flotante nativo --> entero nativo (*)

source: native integer --> decimal string
es: entero nativo --> cadena decimal

source: native integer --> native floating point (*)
es: entero nativo --> punto flotante nativo (*)

source: ne inequality
es: ne distinto que

source: needs to become
es: debe convertirse en

source: next LINE if /^#/;
es: next LINEA if /^#/;

source: no main::getcwd()
es: no existe main::getcwd()

source: no myint;
es: no entero;

source: normal tomato
es: tomate normal

source: not [] character class /u Unicode
es: not [] clase caracteres /u Unicode

source: object-oriented programming
es: programación orientada a objetos

source: of prior m//g)
es: antes de m//g)

source: on the source files.
es: donde <nombres de los archivos> son los archivos de código fuente.

source: open (FH, $path) or return undef;
es: open (ARCHIVO, $ruta) or return undef;
